src/Catalogs/АналогиНормРасходов/АналогиНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналогиНормРасходов</name>
  <owners>Catalog.НормыРасходов</owners>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовНормРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченноеИспользование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/АналогиНормРасходов/АналогиНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналогиНормРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналогНормыРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/АналогиНормРасходов/Forms/ФормаСписка/Module.bsl
&НаСервере
Функция ПолучитьВладельцаФормы()
КоллекцияПолейОтбора=ЭтаФорма.Список.Отбор.Элементы;
ТекущийВладелецФормы=Неопределено;
	Для каждого ПолеОтбора Из КоллекцияПолейОтбора Цикл
		Если Строка(ПолеОтбора.ЛевоеЗначение)="Владелец" Тогда
 		ТекущийВладелецФормы=ПолеОтбора.ПравоеЗначение;
 		Прервать;
 		КонецЕсли;
 	КонецЦикла;
Возврат (ТекущийВладелецФормы);
КонецФункции

&НаСервере
Функция ПолучитьЭлементВладельцаФормы()
КоллекцияПолейОтбора=ЭтаФорма.Список.Отбор.Элементы;
ТекущийЭлементВладельцаФормы=Справочники.НормыРасходов.ПустаяСсылка();
	Для каждого ПолеОтбора Из КоллекцияПолейОтбора Цикл
		Если Строка(ПолеОтбора.ЛевоеЗначение)="Владелец" Тогда
 		ТекущийЭлементВладельцаФормы=ПолеОтбора.ПравоеЗначение;
 		Прервать;
 		КонецЕсли;
 	КонецЦикла;
Возврат(ТекущийЭлементВладельцаФормы.Элемент);
КонецФункции

&НаСервере
Процедура ДобавитьАналогНаСервере(ВыбАналог,Представление)
Владелец = ПолучитьВладельцаФормы();
Приоритет = 1;
ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиНормРасходов(Владелец,,Истина);
	Для каждого ТЧ Из ТаблицаАналогов Цикл
		Если ТЧ.Ссылка.Элемент = ВыбАналог Тогда
		Возврат;
		КонецЕсли;
	Приоритет = Макс(Приоритет,ТЧ.Ссылка.Приоритет);	
	КонецЦикла;
НормыНР = РегистрыСведений.НормыРасходов.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("НормаРасходов",Владелец));
НоваяАНР = Справочники.АналогиНормРасходов.СоздатьЭлемент();
НоваяАНР.Владелец = Владелец;
НоваяАНР.Приоритет = Приоритет + 1;
НоваяАНР.Элемент = ВыбАналог;
НоваяАНР.Наименование = Представление;
	Если ТипЗнч(ВыбАналог) = Тип("СправочникСсылка.Материалы") Тогда
	НоваяАНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Материал;
	ИначеЕсли ТипЗнч(ВыбАналог) = Тип("СправочникСсылка.ТехОперации") Тогда	
	НоваяАНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.ТехОперация;
	ИначеЕсли ТипЗнч(ВыбАналог) = Тип("СправочникСсылка.ТехОснастка") Тогда	
	НоваяАНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.ТехОснастка;
	Иначе
		Если Найти(Представление,"Узел") > 0 Тогда
		НоваяАНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Узел;		
        ИначеЕсли Найти(Представление,"Деталь") > 0 Тогда
        НоваяАНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Деталь;
        ИначеЕсли Найти(Представление,"Основа") > 0 Тогда
        НоваяАНР.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа;
		КонецЕсли; 		
	КонецЕсли;
НоваяАНР.Записать();
РАНР = РегистрыСведений.АналогиНормРасходов.СоздатьМенеджерЗаписи();
РАНР.Период = ТекущаяДата();
РАНР.Владелец = НоваяАНР.Владелец;
РАНР.АналогНормыРасходов = НоваяАНР.Ссылка;
РАНР.Норма = НормыНР.Норма;
РАНР.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВозможныеАналоги(Команда)
СписокАналогов = ОбщийМодульВызовСервера.ПолучитьСписокВозможныхАналогов(ПолучитьЭлементВладельцаФормы());
	Если СписокАналогов.ОтметитьЭлементы("Выберите аналоги для добавления") Тогда
		Для каждого ВыбАналог Из СписокАналогов Цикл
			Если ВыбАналог.Пометка Тогда
			ДобавитьАналогНаСервере(ВыбАналог.Значение,ВыбАналог.Представление);
			КонецЕсли; 
		КонецЦикла; 
	Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере(АНР)
УдаляемыйЭлемент = АНР.ПолучитьОбъект(); 
УдаляемыйЭлемент.Удалить();
КонецПроцедуры 

&НаКлиенте
Процедура УдалитьАналоги(Команда)
	Если Вопрос("Вы действительно хотите удалить аналоги без истории?", РежимДиалогаВопрос.ДаНет, 0) = КодВозвратаДиалога.Нет Тогда
    Возврат;
	КонецЕсли;
		Для каждого ТекСтрока из Элементы.Список.ВыделенныеСтроки Цикл
		УдалитьНаСервере(Элементы.Список.ТекущаяСтрока);
		КонецЦикла;
Элементы.Список.Обновить(); 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЭтаФорма.Заголовок = "Аналоги норм расходов для " +ПолучитьЭлементВладельцаФормы();
Список.Параметры.УстановитьЗначениеПараметра("НаДату",ТекущаяДата());
КонецПроцедуры
